//package HW_5;
//
//public class HW_5_2_4 {
//    public static void main(String[] args) {
//        /*
//Дан массив:
//String[][] array = {{“Привет”, “всем”, “кто”}, {“изучает”, “язык”, “программирования”}, {“java”}};
//необходимо подсчитать количество строк в массиве, которые не содержат буквы “е”.
//*/
//        String[][] array = {{"Привет", "всем", "кто"}, {"изучает", "язык", "программирования"}, {"java"}};
//        int count = 0;
//        for (int i = 0; i < array.length; i++) {
//            for (int j = 0; j < array[i].length; j++) {
//                count++;
//                for (int k = 0; k < array[i][j].length(); k++) {
//                    if(array[i][j].charAt(k) != 'е'){
//array[i].length
//                    }
//
//                }
//
//            }
//
//        }
//        System.out.println(count);
//    }
//}
