//package HW_5;
//
//public class HW_5_2_3 {
//    public static void main(String[] args) {
//        /*Дана строка:
//String s = “Посмотрите как Рите нравится ритм”;
//необходимо вывести индексы начала всех подстрок - “рит”, независимо от регистра.
//Для указанной строки ответ будет 6, 15, 29.
//*/
//        String s = "Посмотрите как рите нравится ритм";
//        String s1 = s.toLowerCase();
//
////        while (s.indexOf("рит") != -1 ){
////            System.out.println(s.indexOf("рит"));
////            if(s.indexOf("рит")){
//
//            }
//
//
//        }
//
//
//               }
//
//
//        }
//
//
//
